content/post/welcome-message.md
+++
title = "Welcome to my corner of the internet!"
author = ["Alain Picard"]
date = 2020-08-05T00:00:00+10:00
draft = false
+++

**Welcome!**

It is odd that I have been online for so long (since 1986 or so)
but have never felt the need to publish content (apart from the occasional
piece of open source software, here and there).  There was one early
attempt, in hand-crafted HTML, around 1994, that I might try to resurrect
for posterity... but nothing since.

What changed?  I guess with the passage of time, my work took
me from being a "producer" to being more of a "mentor".  During my
career I began to notice the same problems, (and often, the same wrong
solutions) over and over, so I figured I might as well write down
some of my thoughts on these matters (not that I expect any to care
what _I_ think!)

Who am I?  A _defrocked astronomer_[^fn:1], then a programmer[^fn:2] in Australia,
where I still reside.
A _rationalist_ because the only way we seem to have figured out things
which are actually true, without lying to ourselves, is the scientific
method.
A _curmudgeon_, certainly, having been told at
the tender age of 17 by my favourite maths professor, no less, that I
had already achieved the cynicism of a 75 year old.  They call it pessimism;
I call it _being a realist_.  Never stopped me from being happy...

I now work as a consultant, principally (but not
exclusively) for small companies using [clojure](https://clojure.org).


## Notes {#notes}

[^fn:1]: I obtained my Ph.D. from [Caltech in 1991](https://www.astro.caltech.edu/department/grad%5Falumni.html), in Cosmology, and worked for a few years at [the European Space Observatory](https://www.esa.int/About%5FUs/ESTEC).
[^fn:2]: Although I worked at many places, the work I am most proud of was performed at [Memetrics](https://newsroom.accenture.com/industries/communications/accenture-to-acquire-maxamine-and-memetrics-expanding-digital-marketing-sciences-services.htm), a now defunct company acquired by Accenture in 2008.
